<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"7877b131b75e45ea2cd7714382d42be3f61bd7c3cda8d016357e1677886b9270","plan_job_ref":"Job Plan Airflow DAGs #243 at https://github.com/cal-itp/data-infra/actions/runs/16209349208","plan_out_hash":"319e56e437761f789305b48a82522d75b6f451f4ba8b47cd1bf14d4bc36ba259","plan_hash":"604ec72b7b5a93c300bb60512de7b6dcd73c61b425add33f310de8df86a5220b","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "kRpTXw==" -> (known after apply)
!~      detect_md5hash      = "jB+vU4xZtSXqFNkXlEOFoQ==" -> "different hash"
!~      generation          = 1752191635207770 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "jB+vU4xZtSXqFNkXlEOFoQ==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "LrvsSQ==" -> (known after apply)
!~      detect_md5hash      = "2K7c85e1EMDnxtjky8pXvw==" -> "different hash"
!~      generation          = 1752191636882005 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "2K7c85e1EMDnxtjky8pXvw==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-partial_parse will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-partial_parse" {
!~      content             = (sensitive value)
!~      crc32c              = "OzNfuQ==" -> (known after apply)
!~      detect_md5hash      = "gQDYRjFTdm3tOMNXeu84Og==" -> "different hash"
!~      generation          = 1752010341206630 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/partial_parse.msgpack"
!~      md5hash             = "gQDYRjFTdm3tOMNXeu84Og==" -> (known after apply)
        name                = "data/warehouse/target/partial_parse.msgpack"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #243](https://github.com/cal-itp/data-infra/actions/runs/16209349208)